
alert("Вітаю Ви Розпочали гру")
alert("Ви з вашою дружиною професійні дайвери , З добрячим стажем у 20 років ви прибули до ІНДОНЕЗІЇ тому що за чутками десь поблизу у печерах глибоко під водою є камінь вічного дихання ")
alert("Пірнути")
alert("Ваша дружина пірнула глибше")
alert("Пірнути за нею")
alert("Ви втрачаєте її з поля зору")
alert("Пірнути глибше")
alert("...")
alert("...")
alert("...")
alert("Ви помічаєте що вам не втстачить кисню в балоні Щоб повернутись на поверхню ")
alert("...")
alert("...")
alert("Шляху назад немає ВИ МУСИТЕ ЗНАЙТИ КАМІНЬ")


// alert("УВАГА ПІСЛЯ ЦЬОГО ПОВІДОМЛЕННЯ У ВАС БУДЕ 60 СЕКУНД НА ВИБІР")
// alert("..3")
// alert("..2")
// alert("..1")
// let timeLimit = 60000; 
// let endTime = Date.now() + timeLimit;
// let question = prompt("Перед вами три печери 1 Абісальний Лабіринт Титанічних Гідротерм 2 Глубинний Хребет Аквамаринового міражу 3 Глибокий Лабіринт Сапфірового Абісу ВВЕДІТЬ НАЗВУ ПЕЧЕРИ КУДИ ХОЧЕТЕ ПІТИ");
// let questionTime = Date.now();

// if (question !== null && questionTime < endTime) {
//   alert("Ви встигли ввести текст!");
// } else {
//   alert("Час вийшов!");
// }



let question = '';
   while (!question) {
     question = prompt("Перед вами три печери 1 Абісальний Лабіринт Титанічних Гідротерм 2 Глубинний Хребет Аквамаринового міражу 3 Глибокий Лабіринт Сапфірового Абісу ВВЕДІТЬ НАЗВУ ПЕЧЕРИ КУДИ ХОЧЕТЕ ПІТИ");
     if (question === 'Абісальний Лабіринт Титанічних Гідротерм' || question === 'Глубинний Хребет Аквамаринового міражу' || question === 'Глибокий Лабіринт Сапфірового Абісу') {
       alert(`Ви обрали: ${question}`)
       alert(`Щож у ${question} не було каменю, вам забракло кисню `)
       ;
     } else {
     alert('Неправильний вибір, спробуйте ще раз.');
       question = '';
     }
   
    }









